In [1]:
import pandas as pd
import numpy as np

In [2]:
# --------------------------
# 샘플데이터
# --------------------------
df = pd.read_csv('data/scores.csv').fillna(0)
df = df.astype({'국어':'int', '수학':'int'})
df['평균'] = df[['국어','영어','수학']].mean(axis=1).round(2)
df

    학번      이름 성별   국어   영어   수학      평균
0    1    kate  f  100   90   95   95.00
1    2  olivia  f   90   80   75   81.67
2    3    emma  f   95  100  100   98.33
3    4  sophia  f  100  100  100  100.00
4    5     amy  f    0   35   60   31.67
5    6   james  m   70   75   65   70.00
6    7  daniel  m   80   90   55   75.00
7    8   peter  m   50   60    0   36.67
8    9   kevin  m  100  100   90   96.67
9   10    jack  m   90   95   70   85.00
10  11   james  m   70   75   65   70.00

### 그룹화 
* `데이터프레임객체.groupby(기준)` --> 그룹객체 리턴
* 데이터를 하나 이상의 열을 기준으로그룹화
* 각 그룹별로 통계 계산(합계, 평균, 개수 등) 수행

In [4]:
# --------------------------
# 성별로 그룹화
# --------------------------
group = df.groupby('성별')

### 그룹 객체의 주요 속성
* `그룹객체.groups` : 그룹별 데이터의 인덱스리스트
* `그룹객체.ngroups` : 그룹의 총 개수

In [5]:
# --------------------------
# 그룹별 인덱스리스트
# --------------------------

group.groups

{'f': [0, 1, 2, 3, 4], 'm': [5, 6, 7, 8, 9, 10]}

In [6]:
# --------------------------
# 그룹의 갯수
# --------------------------
group.ngroups

2

### 그룹 객체의 주요 메서드
* `그룹객체.get_group()` : 특정 그룹의 데이터 출력
* `그룹객체.describe()` : 그룹별 요약통계

#### get_group()
* `그룹객체.get_group('그룹')`

In [8]:
# --------------------------
# 'f'그룹 데이터 
# --------------------------
group.get_group('m')

    학번      이름 성별   국어   영어  수학     평균
5    6   james  m   70   75  65  70.00
6    7  daniel  m   80   90  55  75.00
7    8   peter  m   50   60   0  36.67
8    9   kevin  m  100  100  90  96.67
9   10    jack  m   90   95  70  85.00
10  11   james  m   70   75  65  70.00

#### 그룹별 요약통계
* `그룹객체.describe()`

In [9]:
# --------------------------
# 그룹별 요약통계
# --------------------------

group.describe()

      학번                                               국어             ...  \
   count mean       std  min   25%  50%   75%   max count       mean  ...
성별                                                                    ...
f    5.0  3.0  1.581139  1.0  2.00  3.0  4.00   5.0   5.0  77.000000  ...
m    6.0  8.5  1.870829  6.0  7.25  8.5  9.75  11.0   6.0  76.666667  ...

        수학           평균                                                   \
       75%    max count       mean        std    min    25%   50%    75%
성별
f   100.00  100.0   5.0  81.334000  28.682176  31.67  81.67  95.0  98.33
m    68.75   90.0   6.0  72.223333  20.211475  36.67  70.00  72.5  82.50


       max
성별
f   100.00
m    96.67

[2 rows x 40 columns]

#### 그룹별 특정 컬럼의 요약통계
*  `그룹객체[컬럼].describe()`

In [10]:
# --------------------------
# '평균' 컬럼의 요약통계
# --------------------------

group['국어'].describe()

    count       mean        std   min   25%   50%    75%    max
성별
f     5.0  77.000000  43.243497   0.0  90.0  95.0  100.0  100.0
m     6.0  76.666667  17.511901  50.0  70.0  75.0   87.5  100.0

#### 특정 컬럼의 그룹별 통계값 
* `그룹객체['컬럼명'].통계함수`
    * `count()` : 누락값을 제외한 데이터 수
    * `size()` : 누락값을 포함한 데이터 수
    * `mean()` : 평균
    * `sum()` : 합계
    * `std()` : 표준편차
    * `min()` : 최소값
    * `max()` : 최대값
    * `sum()` : 전체 합

In [13]:
# --------------------------
# 그룹별 총 평균(평균의 평균)
# --------------------------
group['영어'].mean()

성별
f    81.0
m    82.5
Name: 영어, dtype: float64

### 특정 컬럼의 여러 통계값 출력
* `그룹객체.agg({컬럼명:통계함수리스트})`

In [16]:
# --------------------------
# 평균 컬럼의 'sum', 'count', 'mean' 
# --------------------------
group.agg({'영어': ['sum', 'count', 'mean']})
df.groupby("성별").agg({'영어': ['sum', 'count', 'mean']})

     영어
    sum count  mean
성별
f   405     5  81.0
m   495     6  82.5

# 타이타닉 데이터 분석

In [17]:
# --------------------------
# 샘플 데이터
# --------------------------
import seaborn as sns

# 타이타닉 데이터 로드
df_titanic = sns.load_dataset("titanic")
df_titanic = df_titanic.loc[:,['class','who','alone', 'age','survived']].dropna()

# 상위 5개 행 출력
print('shape >>> ', df_titanic.shape)
print('head >>> ')
display(df_titanic.head())
print('info >>> ')
df_titanic.info()

shape >>>  (714, 5)
head >>>

   class    who  alone   age  survived
0  Third    man  False  22.0         0
1  First  woman  False  38.0         1
2  Third  woman   True  26.0         1
3  First  woman  False  35.0         1
4  Third    man   True  35.0         0

info >>>
<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   class     714 non-null    category
 1   who       714 non-null    object
 2   alone     714 non-null    bool
 3   age       714 non-null    float64
 4   survived  714 non-null    int64
dtypes: bool(1), category(1), float64(1), int64(1), object(1)
memory usage: 23.8+ KB

#### class별 평균나이

In [21]:
df_titanic.groupby('class')['age'].mean()
df_titanic.groupby('class').agg({'age': ['mean']})

C:\Users\edukd\AppData\Local\Temp\ipykernel_25632\4179519424.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_titanic.groupby('class')['age'].mean()
C:\Users\edukd\AppData\Local\Temp\ipykernel_25632\4179519424.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_titanic.groupby('class').agg({'age': ['mean']})

              age
             mean
class
First   38.233441
Second  29.877630
Third   25.140620

#### class별 승선자 수

In [22]:
df_titanic.groupby('class')['survived'].count()

C:\Users\edukd\AppData\Local\Temp\ipykernel_25632\624833314.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_titanic.groupby('class')['survived'].count()

class
First     186
Second    173
Third     355
Name: survived, dtype: int64

#### class별 생존자 수

In [24]:
df_titanic.groupby('class')['survived'].sum()

C:\Users\edukd\AppData\Local\Temp\ipykernel_25632\1375855892.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_titanic.groupby('class')['survived'].sum()

class
First     122
Second     83
Third      85
Name: survived, dtype: int64

#### class별 생존율

In [25]:
df_titanic.groupby('class')['survived'].mean()

C:\Users\edukd\AppData\Local\Temp\ipykernel_25632\1999634795.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_titanic.groupby('class')['survived'].mean()

class
First     0.655914
Second    0.479769
Third     0.239437
Name: survived, dtype: float64

#### class별 승선자수, 생존자수, 생존율

In [27]:
df_titanic.groupby('class')['survived'].agg(['count', 'sum', 'mean'])

C:\Users\edukd\AppData\Local\Temp\ipykernel_25632\2211830899.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_titanic.groupby('class')['survived'].agg(['count', 'sum', 'mean'])

        count  sum      mean
class
First     186  122  0.655914
Second    173   83  0.479769
Third     355   85  0.239437

#### who별

In [37]:
df_titanic
df_titanic.groupby('who').get_group('child')

      class    who  alone    age  survived
7     Third  child  False   2.00         0
9    Second  child  False  14.00         1
10    Third  child  False   4.00         1
14    Third  child   True  14.00         0
16    Third  child  False   2.00         0
..      ...    ...    ...    ...       ...
831  Second  child  False   0.83         1
850   Third  child  False   4.00         0
852   Third  child  False   9.00         0
869   Third  child  False   4.00         1
875   Third  child   True  15.00         1

[83 rows x 5 columns]

#### alone별

In [33]:
df_titanic.groupby("alone").groups

{False: [0, 1, 3, 7, 8, 9, 10, 13, 16, 18, 24, 25, 27, 34, 35, 38, 39, 40, 41, 43, 49, 50, 52, 53, 54, 58, 59, 62, 63, 68, 69, 71, 73, 78, 85, 86, 88, 92, 93, 97, 98, 99, 102, 104, 111, 113, 117, 118, 119, 120, 122, 124, 125, 132, 133, 136, 137, 142, 145, 147, 148, 151, 153, 155, 160, 164, 165, 167, 171, 172, 175, 182, 183, 184, 188, 192, 193, 197, 205, 206, 215, 217, 224, 230, 233, 236, 237, 245, 247, 248, 249, 251, 253, 254, 255, 259, 261, 262, 266, 267, ...], True: [2, 4, 6, 11, 12, 14, 15, 20, 21, 22, 23, 30, 33, 37, 44, 51, 56, 57, 60, 61, 66, 67, 70, 72, 74, 75, 79, 80, 81, 83, 84, 89, 90, 91, 94, 96, 100, 103, 105, 106, 108, 110, 112, 114, 115, 116, 123, 127, 129, 130, 131, 134, 135, 138, 139, 141, 143, 144, 146, 149, 150, 152, 156, 157, 161, 162, 163, 169, 170, 173, 174, 177, 178, 179, 187, 189, 190, 191, 194, 195, 199, 200, 202, 203, 204, 207, 208, 209, 210, 211, 212, 213, 216, 218, 219, 220, 221, 222, 225, 226, ...]}